trabalho-pos/app/controllers/categories_controller.rb

INSERT INTO "categories" ("categoryName", "created_at", "updated_at") VALUES (?, ?, ?)  [["categoryName", nil], ["created_at", "2022-10-28 22:52:02.752681"], ["updated_at", "2022-10-28 22:52:02.752681"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save