trabalho-pos/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "value", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["name", "teste"], ["value", "23,5"], ["created_at", "2022-11-05 00:54:34.824558"], ["updated_at", "2022-11-05 00:54:34.824558"], ["category_id", 1]]